{
  "lunch_time": "11:30 AM - 02:30 PM",
  "site_logo": "https://ucarecdn.com/3668aad9-40dc-43d9-ba63-550afe3a0435/",
  "home_page_title": "Everest Base Camp Trek | Yak and Yeti",
  "hero_banner_image": "https://ucarecdn.com/4ea25385-7504-428c-b7e3-7eb823dd24de/-/progressive/yes/-/format/auto/-/resize/2000x/",
  "story_content": "Welcome to Himalayan Kitchen, owned and run by a Sherpa family who are from Himalayan region of Nepal. Sherpas are known as porters or mountain climbers in the western world but they are actually an ethnic group who live in the northern part of Nepal. We believe real food is better for you, your health and for the planet. That’s why we make our foods real, from scratch. Our foods are “Simply Fresh and Made With Love.” and you can see and taste that with everything you try. And all the spices we use are good for your health. Our cuisines, ambience, background music and everything will transport you to the Himalayas at least for the time you are at our place. And we also believe that we are here not only to serve our foods but to exchange cultures. We chose the name “Himalayan Kitchen” because we are from the mountains. Born and raised in the mountains. Not to mention that our Head Chef and the co-owner Nawang Sherpa has climbed the tallest mountain in the world, the Mt. Everest in 1998 after a few unsuccessful attempts before. He has been in the restaurant industry for more than 2 decades, working for different restaurants as a cook and head chef. He also opened Himalayan Restaurant in Coos Bay, Oregon in 2020 before moving here to San Rafael 2023. We opened our door to our guests in this beautiful city on Feb 24, 2023. We also offer private party accommodations for up to 60 guests and off-site catering for any sized party. We also offer to-go party trays. We can tailor your menu to fit any gathering and it would be our pleasure to assist you if you have any questions. Thank you for choosing to dine with us. We really appreciate your love and support.",
  "footer_text": "© Copyright 2024 All rights reserved. Himalayan Kitchen San Rafael, CA.",
  "title_logo": "https://ucarecdn.com/3668aad9-40dc-43d9-ba63-550afe3a0435/",
  "address": "227 3rd St, San Rafael, CA 94901",
  "open_information": "Open Daily",
  "dinner_time": "04:30 PM - 09:00 PM",
  "phone_number": "(415) 526-3161",
  "menu_service_charge_description": "we reserve the right to refuse service to anyone. we do to go and catering for any events. for details please visit at www.himalayankitchenmarin.com. this facility uses nuts, wheat, dairy etc, please notify us of any allergies. 18% gratuity is added to the party of 6 or more. namaste and thank you.'",
  "email": "himalayankitchenmarin@gmail.com",
  "video_id": "r1Y2-0UZmPM",
  "story_sub_description": "Hello! Namaste! & Tashi Delek!",
  "order_online_url": "https://order.toasttab.com/online/himalayan-kitchen-227-3rd-st",
  "map_latitude": "38.31875567024663",
  "map_longitude": "-122.29787100727772",
  "map_zoom_level": "20"
}
