{
  "lunch_time": "11:30 AM - 03:00 PM DAILY",
  "site_logo": "/uploads/yak-yeti-logo-xs.png",
  "home_page_title": "Everest Base Camp Trek | Yak and Yeti",
  "hero_banner_image": "https://ucarecdn.com/4ea25385-7504-428c-b7e3-7eb823dd24de/-/progressive/yes/-/format/auto/-/resize/2000x/",
  "story_content": "Located at 3150 B Jefferson Street in Napa, CA, Yak and Yeti is delighted to offer the best of Indian, Nepalese and Tibetan cuisine. Owned by the Sherpas originally from Mt. Everest region, Yak and Yeti dishes mainly include recipes that fuel trekkers along their way to Everest Base Camp. The kitchen also features a heart-healthy Tandor Oven, where the naan and other items like kabobs and chicken tikka masala are prepared. Other popular delicacies like the momos (handmade authentic Tibetan dumplings stuffed with your choice of meat or veggies) are prepared following traditional methods and recipes. At Yak and yeti, we’d like our customers to experience the Himalayas when they taste our food. Yak and Yeti opened its doors in 2017 to offer the best of the Himalayan state to Napa Valley. Please browse our menu to explore the different dishes that we carry.",
  "about_us": "In the late nineties, owners Kam Chhiring moved to California and found a home in the heart of Sonoma Valley. In 1997 Kam opened his first restaurant which he named Himalayan Sherpa Cuisine in Glen Ellen.\n\nFood is at the heart of the human experience. Everyone eats, and the experience should be an enjoyable one. With this in mind, Himalayan Sherpa Kitchen was born. There was no promise of success as most of St. Helena’s restaurants fall under French and Italian influence. A Nepalese place would be out of the norm but the quaint location excited the pair and on May 29, 2012, Himalayan Sherpa Kitchen opened its doors to the public, and it has been a fantastic adventure ever since.\n\nHimalayan Sherpa has become a staple in the St. Helena community. Whether it’s a place to catch up with old friends, have a casual dinner out with the family or to grab a quick lunch before work. Locals refer to the chicken tikka masala as a drug they have no hopes of quitting. They feel blessed to be able to be a part of such a wonderful community.",
  "footer_text": "© Copyright 2024 All rights reserved. Yak and Yeti Restaurant, Napa CA.",
  "title_logo": "/uploads/yak-yeti-logo-xs.png",
  "address": "3150 B Jefferson Street Napa, CA 94558",
  "open_information": "OPEN EVERYDAY",
  "dinner_time": "05:00 PM - 09:00 PM DAILY",
  "phone_number": "(707) 666-2475",
  "menu_service_charge_description": "18% Service Charge may be added to parties of 6 or more. We do To Go and Catering for your private events. For more information please visit at www.yakandyetinapa.com or 707-666-2475. This facility uses nuts, wheat, dairy, etc. Please notify us of any allergies. THANK YOU!!! SEE YOU SOON",
  "email": "yakandyetinapa@gmail.com",
  "video_id": "r1Y2-0UZmPM",
  "story_sub_description": "From the Himalayas to the heart of wine country - Napa, CA",
  "order_online_url": "https://www.toasttab.com/yak-and-yeti/v3"
}
